In [275]:
import pandas as pd
from pandasql import sqldf
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_dir = 'kaggle-survey-2018/'

In [3]:
free_form = pd.read_csv(data_dir + 'freeFormResponses.csv')
multiple_choice = pd.read_csv(data_dir + 'multipleChoiceResponses.csv')
survey_schema = pd.read_csv(data_dir + 'SurveySchema.csv')

C:\Users\victors\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2698: DtypeWarning: Columns (25) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
C:\Users\victors\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2698: DtypeWarning: Columns (0,2,8,10,21,23,24,25,26,27,28,44,56,64,83,85,87,107,109,123,125,150,157,172,174,194,210,218,219,223,246,249,262,264,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,304,306,325,326,329,341,368,371,384,385,389,390,391,393,394) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
multiple_choice.shape

(23860, 395)

In [5]:
free_form.shape

(23860, 35)

In [6]:
multiple_q = multiple_choice.loc[0, :]
multiple_a = multiple_choice.loc[1:, :]

In [7]:
multiple_a.groupby(by='Q1')['Q1'].count()

Q1
Female                      4010
Male                       19430
Prefer not to say            340
Prefer to self-describe       79
Name: Q1, dtype: int64

In [16]:
sqldf("""select * from survey_schema""").head()

,2018 Kaggle Machine Learning and Data Science Survey,Q1,Q10,Q11,Q12,Q13,Q14,Q15,Q16,Q17,...,Q47,Q48,Q49,Q5,Q50,Q6,Q7,Q8,Q9,Time from Start to Finish (seconds)
0,Question:,What is your gender? - Selected Choice,Does your current employer incorporate machine...,Select any activities that make up an importan...,What is the primary tool that you use at work ...,Which of the following integrated development ...,Which of the following hosted notebooks have y...,Which of the following cloud computing service...,What programming languages do you use on a reg...,What specific programming language do you use ...,...,What methods do you prefer for explaining and/...,"Do you consider ML models to be ""black boxes"" ...",What tools and methods do you use to make your...,Which best describes your undergraduate major?...,What barriers prevent you from making your wor...,Select the title most similar to your current ...,In what industry is your current employer/cont...,How many years of experience do you have in yo...,What is your current yearly compensation (appr...,Duration (in seconds)
1,# of Respondents:,23860,20670,19518,19199,19117,18971,18864,18828,15223,...,13418,13369,12891,22948,12814,22901,21686,21102,20186,23860
2,Who was excluded? (0 = not excluded; 1 = exclu...,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,If What is your age (# years)? 0-17 Is Selecte...,0,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,0
4,If What is the highest level of formal educati...,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0

In [161]:
questions = survey_schema.loc[0, :]

In [29]:
questions.to_csv('questions.csv')

In [165]:
multiple_choice = multiple_choice.loc[1:,:].copy()

In [166]:
multiple_choice.loc[multiple_choice['Q1']=='Male',['Q9']]

                                                      Q9
2                                              10-20,000
4                                                    NaN
5                                               0-10,000
6      I do not wish to disclose my approximate yearl...
7                                              10-20,000
8                                               0-10,000
9                                                    NaN
10                                             20-30,000
11     I do not wish to disclose my approximate yearl...
12                                           125-150,000
13                                             30-40,000
14                                             30-40,000
16                                             30-40,000
17                                             50-60,000
18                                              0-10,000
19                                           100-125,000
20                                             30-40,000
23                                            90-100,000
25                                             70-80,000
26                                              0-10,000
27                                              0-10,000
31                                                   NaN
32                                             70-80,000
33                                           100-125,000
36                                            90-100,000
37     I do not wish to disclose my approximate yearl...
38                                             30-40,000
39                                             80-90,000
40                                             10-20,000
41                                           400-500,000
...                                                  ...
23817                                          30-40,000
23818                                                NaN
23819                                                NaN
23821                                           0-10,000
23822  I do not wish to disclose my approximate yearl...
23823                                           0-10,000
23824                                          70-80,000
23825                                                NaN
23827  I do not wish to disclose my approximate yearl...
23828                                           0-10,000
23829  I do not wish to disclose my approximate yearl...
23830                                                NaN
23832                                                NaN
23833                                           0-10,000
23834  I do not wish to disclose my approximate yearl...
23836                                          10-20,000
23839                                           0-10,000
23842                                           0-10,000
23843                                                NaN
23844                                         90-100,000
23845                                           0-10,000
23847                                                NaN
23848  I do not wish to disclose my approximate yearl...
23849                                                NaN
23851                                                NaN
23854                                          10-20,000
23855                                        250-300,000
23857                                          10-20,000
23858                                                NaN
23859                                                NaN

[19430 rows x 1 columns]

In [167]:
sqldf("""select Q1, Q9, count(*) from multiple_choice group by 1, 2 order by count(*) desc""").head()

     Q1                                                 Q9  count(*)
0  Male  I do not wish to disclose my approximate yearl...      3759
1  Male                                           0-10,000      3610
2  Male                                               None      2805
3  Male                                          10-20,000      1616
4  Male                                          20-30,000      1181

In [168]:
sqldf("""select Q9, count(*) from multiple_choice group by 1 order by count(*) desc""")

                                                   Q9  count(*)
0   I do not wish to disclose my approximate yearl...      4756
1                                            0-10,000      4398
2                                                None      3674
3                                           10-20,000      1937
4                                           20-30,000      1395
5                                           30-40,000      1119
6                                           40-50,000       965
7                                           50-60,000       919
8                                         100-125,000       843
9                                           60-70,000       729
10                                          70-80,000       677
11                                         90-100,000       566
12                                        125-150,000       533
13                                          80-90,000       506
14                                        150-200,000       457
15                                        200-250,000       172
16                                        250-300,000        75
17                                           500,000+        63
18                                        300-400,000        52
19                                        400-500,000        23

In [169]:
sqldf("""select Q9, count(*) from multiple_choice where Q1 = 'Male' and Q3 = 'United States of America' group by 1 order by count(*) desc""")

                                                   Q9  count(*)
0   I do not wish to disclose my approximate yearl...       532
1                                         100-125,000       403
2                                                None       396
3                                         150-200,000       289
4                                         125-150,000       283
5                                            0-10,000       232
6                                          90-100,000       199
7                                           70-80,000       195
8                                           80-90,000       161
9                                           60-70,000       146
10                                        200-250,000       120
11                                          50-60,000       117
12                                          20-30,000       115
13                                          30-40,000        92
14                                          10-20,000        82
15                                          40-50,000        76
16                                        250-300,000        40
17                                        300-400,000        28
18                                           500,000+        15
19                                        400-500,000         9

In [170]:
sqldf("""select Q9, count(*) from multiple_choice where Q1 = 'Female' and Q3 = 'United States of America' group by 1 order by count(*) desc""")

                                                   Q9  count(*)
0   I do not wish to disclose my approximate yearl...       198
1                                                None       150
2                                         100-125,000        97
3                                            0-10,000        96
4                                         125-150,000        78
5                                           80-90,000        68
6                                           70-80,000        55
7                                          90-100,000        54
8                                           60-70,000        50
9                                           50-60,000        45
10                                          20-30,000        39
11                                        150-200,000        38
12                                          10-20,000        35
13                                          30-40,000        35
14                                          40-50,000        33
15                                        250-300,000         5
16                                           500,000+         3
17                                        200-250,000         2
18                                        300-400,000         1

In [171]:
sqldf("""select Q3, count(*) from multiple_choice group by 1 order by count(*) desc""")

                                                   Q3  count(*)
0                            United States of America      4716
1                                               India      4417
2                                               China      1644
3                                               Other      1036
4                                              Russia       879
5                                              Brazil       736
6                                             Germany       734
7   United Kingdom of Great Britain and Northern I...       702
8                                              Canada       604
9                                              France       604
10                                              Japan       597
11                                              Spain       485
12              I do not wish to disclose my location       394
13                                              Italy       355
14                                          Australia       330
15                                             Turkey       327
16                                             Poland       301
17                                        Netherlands       270
18                                            Ukraine       252
19                                            Nigeria       208
20                                             Mexico       202
21                                        South Korea       188
22                                          Singapore       186
23                                             Israel       173
24                                          Indonesia       171
25                                        Switzerland       164
26                                           Pakistan       161
27                                           Portugal       155
28                                             Sweden       155
29                                       South Africa       147
30                                           Viet Nam       144
31                                           Colombia       128
32                                             Greece       121
33                                          Argentina       119
34                       Iran, Islamic Republic of...       113
35                                           Malaysia       113
36                                            Belgium       111
37                                         Bangladesh       107
38                                            Denmark       106
39                                            Ireland       101
40                                              Egypt        96
41                                            Hungary        93
42                                            Belarus        91
43                                              Kenya        85
44                                               Peru        81
45                                            Finland        79
46                                            Romania        79
47                                        New Zealand        77
48                                              Chile        76
49                                 Hong Kong (S.A.R.)        76
50                                             Norway        74
51                                            Tunisia        74
52                                        Philippines        73
53                                           Thailand        73
54                                     Czech Republic        72
55                                            Morocco        71
56                                  Republic of Korea        71
57                                            Austria        62

In [255]:
def convert_salary(salary):

    if salary == '500,000+':
        return 500000
    else:
        try:
            a, b = salary.replace(',','').split('-')
            avg = (int(a)*1000+int(b))/2
            return avg
        except:
            return None

In [256]:
def convert_xp(xp, return_type):
    if xp == '30 +':
        xp = 30
    elif xp == '40+ years':
        xp = 40
    elif xp == '< 1 year':
        xp = 0.5
    else:
        try:
            a, b = xp.replace(' years', '').split('-')
            xp = (int(a)+int(b))/2
        except:
            return None
        
    if return_type == 'years':
        return xp
    elif return_type == 'seniority level':
        if xp < 3:
            return 0
        elif xp < 6:
            return 1
        else:
            return 2
    else:
        return None

In [257]:
df = pd.DataFrame()

In [258]:
df['gender'] = multiple_choice.Q1
df['current_role_xp'] = multiple_choice.Q8.apply(convert_xp, args = ('years',))
df['coding_xp'] = multiple_choice.Q24.apply(convert_xp, args = ('years',))
df['ml_xp'] = multiple_choice.Q25.apply(convert_xp, args = ('years',))
df['current_role_xp_level'] = multiple_choice.Q8.apply(convert_xp, args = ('seniority level',))
df['coding_xp_level'] = multiple_choice.Q24.apply(convert_xp, args = ('seniority level',))
df['ml_xp_level'] = multiple_choice.Q25.apply(convert_xp, args = ('seniority level',))
df['income'] = multiple_choice.Q9.apply(convert_salary)

In [259]:
df.head()

,gender,current_role_xp,coding_xp,ml_xp,current_role_xp_level,coding_xp_level,ml_xp_level,income
1,Female,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Male,7.5,NaN,NaN,2.0,NaN,NaN,15000.0
3,Female,0.5,7.5,0.5,0.0,2.0,0.0,5000.0
4,Male,NaN,7.5,4.5,NaN,2.0,1.0,NaN
5,Male,0.5,7.5,2.5,0.0,2.0,0.0,5000.0

In [278]:
sns.scatterplot(x='coding_xp', y='income', data=df)

AttributeError: module 'seaborn' has no attribute 'scatterplot'

In [277]:
import seaborn as sns